Tekla Open API Reference for Tekla Structures 2025
GeometrySectionEnumerator Properties
The GeometrySectionEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current geometry section.
Top
See Also
Reference
GeometrySectionEnumerator Class
Tekla.Structures.Model Namespace